val subjectTestRespBody404 = """
    {
        "title": "Bad Request",
        "details": {
            "path": "/v0/subjects/526816000000",
            "method": "GET"
        },
        "request_id": "95745723e8f40448-LHR",
        "description": "\"526816000000\" is not valid ID"
    }
""".trimIndent()
val subjectTestRespBody = """
        {
            "date": "2025-04-08",
            "platform": "TV",
            "images": {
                "small": "https://lain.bgm.tv/r/200/pic/cover/l/27/84/526816_i7w6d.jpg",
                "grid": "https://lain.bgm.tv/r/100/pic/cover/l/27/84/526816_i7w6d.jpg",
                "large": "https://lain.bgm.tv/pic/cover/l/27/84/526816_i7w6d.jpg",
                "medium": "https://lain.bgm.tv/r/800/pic/cover/l/27/84/526816_i7w6d.jpg",
                "common": "https://lain.bgm.tv/r/400/pic/cover/l/27/84/526816_i7w6d.jpg"
            },
            "summary": "天手让叶是名女高中生，在空中的宇宙殖民卫星过着平静的生活。\r\n\r\n但在遇到难民少女尼娅安后，她被卷入了非法MS决斗竞技《军团战》之中。她化名《玛秋》参赛，驾驶着GQuuuuuuX，每日投身激烈的战斗。\r\n\r\n同时，被宇宙军和警察两方追捕的神秘MS《高达》及其驾驶员──少年修司，出现在她们面前。\r\n\r\n接着，世界迎向了新时代。\r\n\r\n宇宙に浮かぶスペース・コロニーで平穏に暮らしていた女子高生アマテ・ユズリハは、戦争難民の少女ニャアンと出会ったことで、非合法なモビルスーツ決闘競技《クランバトル》に巻き込まれる。\r\n\r\nエントリーネーム《マチュ》を名乗るアマテは、 GQuuuuuuX ジークアクス を駆り、苛烈なバトルの日々に身を投じていく。\r\n\r\n同じ頃、宇宙軍と警察の双方から追われていた正体不明のモビルスーツ《ガンダム》と、そのパイロットの少年シュウジが彼女の前に姿を現す。\r\n\r\nそして、世界は新たな時代を迎えようとしていた。",
            "name": "機動戦士Gundam GQuuuuuuX",
            "name_cn": "机动战士高达 GQuuuuuuX",
            "tags": [
                {
                    "name": "高达",
                    "count": 1717,
                    "total_cont": 0
                },
                {
                    "name": "原创",
                    "count": 1570,
                    "total_cont": 0
                },
                {
                    "name": "机战",
                    "count": 1454,
                    "total_cont": 0
                },
                {
                    "name": "2025年4月",
                    "count": 1207,
                    "total_cont": 0
                },
                {
                    "name": "科幻",
                    "count": 1190,
                    "total_cont": 0
                },
                {
                    "name": "TV",
                    "count": 1132,
                    "total_cont": 0
                },
                {
                    "name": "SUNRISE",
                    "count": 1117,
                    "total_cont": 0
                },
                {
                    "name": "庵野秀明",
                    "count": 813,
                    "total_cont": 0
                },
                {
                    "name": "鹤卷和哉",
                    "count": 729,
                    "total_cont": 0
                },
                {
                    "name": "Khara",
                    "count": 700,
                    "total_cont": 0
                },
                {
                    "name": "日本",
                    "count": 539,
                    "total_cont": 0
                },
                {
                    "name": "2025",
                    "count": 515,
                    "total_cont": 0
                },
                {
                    "name": "战斗",
                    "count": 437,
                    "total_cont": 0
                },
                {
                    "name": "萝卜",
                    "count": 230,
                    "total_cont": 0
                },
                {
                    "name": "冒险",
                    "count": 203,
                    "total_cont": 0
                },
                {
                    "name": "榎戸洋司",
                    "count": 84,
                    "total_cont": 0
                },
                {
                    "name": "鶴巻和哉",
                    "count": 63,
                    "total_cont": 0
                },
                {
                    "name": "百合",
                    "count": 36,
                    "total_cont": 0
                },
                {
                    "name": "GUNDAM",
                    "count": 29,
                    "total_cont": 0
                },
                {
                    "name": "榎户洋司",
                    "count": 27,
                    "total_cont": 0
                },
                {
                    "name": "2025年",
                    "count": 24,
                    "total_cont": 0
                },
                {
                    "name": "恋爱",
                    "count": 15,
                    "total_cont": 0
                },
                {
                    "name": "搞笑",
                    "count": 15,
                    "total_cont": 0
                },
                {
                    "name": "季番",
                    "count": 15,
                    "total_cont": 0
                },
                {
                    "name": "黑泽朋世",
                    "count": 13,
                    "total_cont": 0
                },
                {
                    "name": "4月",
                    "count": 13,
                    "total_cont": 0
                },
                {
                    "name": "无法预测的命运之舞台",
                    "count": 12,
                    "total_cont": 0
                },
                {
                    "name": "日本动画",
                    "count": 11,
                    "total_cont": 0
                },
                {
                    "name": "少女",
                    "count": 9,
                    "total_cont": 0
                },
                {
                    "name": "robot",
                    "count": 7,
                    "total_cont": 0
                }
            ],
            "infobox": [
                {
                    "key": "中文名",
                    "value": "机动战士高达 GQuuuuuuX"
                },
                {
                    "key": "别名",
                    "value": [
                        {
                            "v": "gqx"
                        },
                        {
                            "v": "Kidou Senshi Gundam GQuuuuuuX"
                        },
                        {
                            "v": "Mobile Suit Gundam GQuuuuuuX"
                        },
                        {
                            "v": "機動戦士Gundam ジークアクス"
                        },
                        {
                            "v": "機動戰士高達 GQuuuuuuX"
                        },
                        {
                            "v": "機動戰士鋼彈 GQuuuuuuX"
                        }
                    ]
                },
                {
                    "key": "话数",
                    "value": "12"
                },
                {
                    "key": "放送开始",
                    "value": "2025年4月8日"
                },
                {
                    "key": "放送星期",
                    "value": "星期二"
                },
                {
                    "key": "官方网站",
                    "value": "https://www.gundam.info/feature/gquuuuuux/"
                },
                {
                    "key": "在线播放平台",
                    "value": "Amazon Prime Video"
                },
                {
                    "key": "播放电视台",
                    "value": "日本テレビ系30局"
                },
                {
                    "key": "其他电视台",
                    "value": "BS11"
                },
                {
                    "key": "播放结束",
                    "value": "2025年6月24日"
                },
                {
                    "key": "导演",
                    "value": "鶴巻和哉"
                },
                {
                    "key": "音乐",
                    "value": "照井順政、蓮尾理之"
                },
                {
                    "key": "Copyright",
                    "value": "©創通・サンライズ"
                },
                {
                    "key": "原作",
                    "value": "矢立肇、富野由悠季"
                },
                {
                    "key": "系列构成",
                    "value": "榎戸洋司"
                },
                {
                    "key": "人物原案",
                    "value": "安彦良和；人物设定：竹"
                },
                {
                    "key": "人物设定",
                    "value": "动画人设：池田由美、小堀史絵"
                },
                {
                    "key": "机械设定",
                    "value": "山下いくと；动画机设：金世俊；机动战士原案：大河原邦男"
                },
                {
                    "key": "总作画监督",
                    "value": "人物总作监：池田由美、小堀史絵；机械总作监：金世俊；人物总作监辅佐：井関修一、kojikoji(小島大和)、秋津達哉、渡部貴喜、菅野利之、渡邊義弘"
                },
                {
                    "key": "美术监督",
                    "value": "加藤浩（ととにゃん）；辅佐：後藤千尋（ととにゃん）"
                },
                {
                    "key": "美术设计",
                    "value": "加藤浩（ととにゃん）；概念艺术：上田創（ウエダハジメ）；美术设定原案：中村光毅"
                },
                {
                    "key": "设定",
                    "value": "渭原敏明、前田真宏、阿部慎吾、松原秀典、井関修一、絵を描くPETER、網、稲田航、ミズノシンヤ、大村祐介、増田朋子、鶴巻和哉、射尾卓弥、高倉武史、林絢雯、庵野秀明、mebae(PONCOTAN)、出渕裕；细节设定：渭原敏明、田中達也"
                },
                {
                    "key": "色彩设计",
                    "value": "井上あきこ（Wish）"
                },
                {
                    "key": "摄影监督",
                    "value": "塩川智幸（T2 studio）"
                },
                {
                    "key": "CG 导演",
                    "value": "鈴木貴志"
                },
                {
                    "key": "剪辑",
                    "value": "辻田恵美"
                },
                {
                    "key": "音乐制作人",
                    "value": "山田智子、舩橋宗寛、大浜拓哉"
                },
                {
                    "key": "音乐制作",
                    "value": "バンダイナムコミュージックライブ、島居理恵（スタジオカラー）"
                },
                {
                    "key": "音响监督",
                    "value": "山田陽（サウンドチーム・ドンファン）"
                },
                {
                    "key": "音响",
                    "value": "音响制作：サウンドチーム・ドンファン；音响制作担当：有馬加奈子"
                },
                {
                    "key": "音效",
                    "value": "山谷尚人（サウンドボックス）"
                },
                {
                    "key": "录音",
                    "value": "鶴巻慶典"
                },
                {
                    "key": "录音助理",
                    "value": "中内真子"
                },
                {
                    "key": "执行制片人",
                    "value": "小形尚弘"
                },
                {
                    "key": "制片人",
                    "value": "笠井圭介、伴在正行"
                },
                {
                    "key": "总制片人",
                    "value": "杉谷勇樹(主制片人)"
                },
                {
                    "key": "制作管理",
                    "value": "田中隼人"
                },
                {
                    "key": "设定制作",
                    "value": "田中隼人"
                },
                {
                    "key": "动画制作",
                    "value": "khara×サンライズ"
                },
                {
                    "key": "製作",
                    "value": "バンダイナムコフィルムワークス(浅沼誠)、日本テレビ放送網(桑原勇蔵)"
                },
                {
                    "key": "制作协力",
                    "value": "創通、ADKマーケティング・ソリューションズ"
                },
                {
                    "key": "协力",
                    "value": "バンダイ、BANDAI SPIRITS、バンダイナムコエンターテインメント"
                },
                {
                    "key": "脚本",
                    "value": "榎戸洋司、庵野秀明"
                },
                {
                    "key": "分镜",
                    "value": "鶴巻和哉、庵野秀明、前田真宏、谷田部透湖、荒木哲郎、高村和宏、澤真平、寺岡巌、上村泰"
                },
                {
                    "key": "演出",
                    "value": "鶴巻和哉、小松田大全、谷田部透湖、荒木哲郎、倉富康平、中西基樹、伊藤慎之助、安部保仁"
                },
                {
                    "key": "演出助理",
                    "value": "瀬木日太"
                },
                {
                    "key": "作画监督",
                    "value": "人物作画监督：池田由美、小堀史絵、松原秀典、中村真由美、井関修一、本多弘幸、寺尾洋之、渡部貴喜、mebae(PONCOTAN)、中島里恵、山口葵、大竹守、長部州太、小谷杏子、長尾浩生、中村佑美子、島村秀一、伊藤瑞希、中尾高之"
                },
                {
                    "key": "机械作画监督",
                    "value": "金世俊、阿部慎吾、浅野元、森寛之、大浪太、小田裕康、寺尾憲治、寺尾洋之、中島竹流、小松英司、倉本和希、平岡雅樹、久壽米木信弥、鈴木勘太"
                },
                {
                    "key": "OP・ED 分镜",
                    "value": "鶴巻和哉 / 谷田部透湖"
                },
                {
                    "key": "主题歌作词",
                    "value": "米津玄師 / Yuki Tsujimara"
                },
                {
                    "key": "主题歌作曲",
                    "value": "米津玄師 / Naoki Itai & Yuki Tsujimara"
                },
                {
                    "key": "主题歌编曲",
                    "value": "米津玄師 / Naoki Itai"
                },
                {
                    "key": "主题歌演出",
                    "value": "米津玄師 / 星街すいせい"
                },
                {
                    "key": "插入歌演出",
                    "value": "NOMELON NOLEMON、星街すいせい、岡地織花"
                },
                {
                    "key": "动画检查",
                    "value": "村田康人；数字动画检查：彼末真由子（スタジオエイトカラーズ）、中野江美"
                },
                {
                    "key": "CGI动画指导",
                    "value": "岩里昌則、森本シグマ"
                },
                {
                    "key": "CGI建模指导",
                    "value": "若月薪太郎、楠戸亮介"
                },
                {
                    "key": "CGI武装指导",
                    "value": "熊谷春助"
                },
                {
                    "key": "CGI美术指导",
                    "value": "小林浩康"
                },
                {
                    "key": "图像设计指导",
                    "value": "座間香代子"
                },
                {
                    "key": "视效开发指导",
                    "value": "千合洋輔"
                },
                {
                    "key": "特技监督",
                    "value": "矢辺洋章"
                },
                {
                    "key": "LookDev",
                    "value": "平林奈々恵、三木陽子"
                },
                {
                    "key": "数字制作管理",
                    "value": "藤原滉平"
                },
                {
                    "key": "原画",
                    "value": "阿部慎吾、浅野元、井関修一、森久司、小口萌花、長谷川哲也、半田修平、すしお、徳田靖、松村佳子、大島塔也、碇谷敦、岩堀起久、柴田夏来、富田浩章、藤原舞似子、池田由美、小堀史絵、金世俊、鶴巻和哉、前田真宏、村木靖、桝田浩史、富岡隆司、仲盛文、鈴木俊二、伊藤憲子、秋津達哉、崎山知明、小嶋慶祐、金子秀一、伊藤秀次、山田有慶、五十嵐祐貴、澁川大祐、射尾卓弥、鈴木幸江、加瀬幸治、小松英司、庵野秀明、雨宮哲、田澤潮、阿部尚人、長部州太、野村雅史、南野諒、宇良隆太、高橋裕一、朱原デーナ、上田幸一郎、坂本勝、阿見圭之介、中村真由美、谷田部透湖、田川裕子、大塚健、辻彩夏、岡田直樹、三木達也、杉山和隆、諸冨直也、宮村明、田中宏紀、根本卓弥（studio maf）、芳山優、荒木哲郎、坂本修司、工藤友靖、中島里恵、TOMATO、黄捷、板倉和弘、寺尾洋之、小田裕康、寺尾憲治、黒木涼之介、松田萌、阿部慈光、奥谷周子、北野麗仁、玄宇晞、ツブキケン"
                },
                {
                    "key": "第二原画",
                    "value": "崎山知明、野崎真一、合田麻美、よーと、富田浩章、高橋德詔、藤代ゆえ、工藤友靖、永田善敬、高畑かおり、藤井萌依、伊藤慎之助、山下梨早、江良桜子、津留幸代、OUTLINE（あいう、光岡美来）、スタジオKAI（麻生遥希、齊藤亮太、田中大地、中島裕樹、野津駿兵、平山雄都）、新潟アニメーション（土田康平）、ufotable（小山将治）、ちーむはらだ、SURASAK PHAPIJIT、STUDIO MASSKET、曽根拓人、小西有沙、张逸晖、檀浦啓伸、藤原舞似子、WIT STUDIO（島井響子）、宮元彩花、坂本和哉、前田清明、寒川顕一、生水勇気、佐藤天哉、植竹美則、小林美範、大津りか"
                },
                {
                    "key": "补间动画",
                    "value": "khara（芝田洸太郎、幸田真奈、牛嶋裕一朗、中野来叶、西村都）、株式会社くるせる/REVOROOT（大越武志、小島知之、竹村秀和、大谷ジョーンズ セバスチャン、柳原迅、高橋せれん、矢倉顯、小澤夢奈）、Production I.G（船山千帆、野上麻衣子、書田仁美、岩本和、芳野汐理、Nagi Hiu Tung、CHEN TONG、上野真依子、菅田朋子、瀬戸川雄大、佐久間奈央、進藤亘汰、池田葵）、PINE JAM（神谷友亮、北田遥人、鳥羽星輝、佐藤深雪、大毛恭平、橋本新太、岸田くるみ）、CygamesPictures（中村連斗、酒井勇輝、碓井遥仁、新家新芽、紗枝憧、宮本真衣、川瀬愛斗、花井柊斗、楊詩穎、小山冬真、沖吉良唯）、Studio 3Hz（竺佳銘、島袋雄太、長谷川みゆ）、CoMix Wave Films（橋本実里、笠川梨紗、松岡理惠子、平尾春人、内海加奈惠）、OLM（森田温斗、山田玲子、许炜、佐藤梨菜、中口真那、鄭豪杰、伊藤裕美、齋藤友希、河智珉、小川千星、村瀬夏奈子）、CLAP（伊藤誠、表雅扶理）、SHAFT（浦孝隅、加藤美月、リュウシエツ、櫻井萌美、桐明龍信、野村もも、亀井涼花、丸山莉果、山田詩乃、田仲ひかる、坪田英里香、関菜々美、佐野愛子）、シグナル·エムディ（佐藤かおる、高橋みか、カルデナ、高松真優、相澤悠、田中孝介、池田慎佳、陳惟真、平川遥奈、高松聖）、アンサー・スタジオ（グェン ティ ホン 、姜琇頻）、新潟アニメーション（土田康平、滝澤優、渋谷一樹、植田大輝）、株式会社スタジオKAI（麻生遥希、齊藤亮太、佐々木太陽、髙石悠斗、中村萌美、宮本絢音、島貫拓巳）、Seven Arcs（荒木秀太、小林大芽、花形恭平、矢野美琴、周点）、ENGI（黒川飛鳥、板橋裕斗、岡田賢治、小林良平、吉川綾音、吴瑜玹）、TRIGGER（紙田龍之介、市岡侑真）、日本アニメーション（青山広梦）、スタジオコロリド（赤木佑衣、野口愛美、阿世賀詩歩、馬迈）、スタジオコロリドteamヤマヒツヂ（白石大地、武田紀香）、スタジオコロリド京都（張灃、小島拓也、金原沙耶、百々ありさ、久古歩美、谷口裕理、林安琪）、ジェノスタジオ（加藤杏梓、Sjoberg Ida）、ブリッジ（山岡夏樹、鈴木颯香）、BN Pictures クリエイティブルーム（富山裕生、中村真大、浅野奏穗、小野寺まゆみ、山本千夏子、寺谷紀菜）、MSJ武蔵野制作所（勝美智子、平田卓也、三浦嘉友、篠塚由紀、與儀有美）、太観アニメ、WHITE FOX 伊豆高原スタジオ（森菜月、高田彩）、Andraft Inc.（仁志晃子、小山清太）、ドライブ（大島慶）、ソウネ（今西麻綾）、CONTRAIL（桑原麻利絵、高橋彩、中沢寛史、田中沙樹、牧野ひなこ、木村文香、酒川智央）、Wish、STUDIO MASSKET、EMTスクエアード（赤松瞭、星野巧、長野詩音、斉藤洋治）、VISTA、シンエイ動画 神戸スタジオ（三俣拓人、瀬戸口敢汰、増川実紗、鎌田一将、黒田晴香）、TROYCA（文野アスカ、角貝早那、秋葉奈美惠、万福寧々、橋本諒子、野村爱実、深野真央、高橋歩夢）、ぎふとアニメーション（小林和、千葉谷、巴山まつり、堀みづき、居川もえの、木村涼、鈴木蛍斗、野久尾和哉）、暁、サンライズ作画塾（尾関華）、朱夏（高橋悠香、稲葉理紗、大澤葵衣、本多亜海、石森真理、高橋淳美、平坂凛花、酒井汐音）、京都アニメーション、ピー·アール·エー作画部（足立莉奈、海野姬花）、旭プロダクション（魏天漠）、CONNECT（藤川大夢、川原萌絵）、所沢映画、Triple A、Reboot、OLM Asia、中野江美、彼末真由子（スタジオエイトカラーズ）、张逸晖、甲斐美有、玉置雅代、船橋正紘、三浦綾華、藤代ゆえ、伊藤慎之助、関川亨、手塚帆香、浅野元、尾山景子、古木優、児玉いずみ、渡邊妙子、阿武惠子、高橋俊、石田まい乃、須之部美野、堀みなみ、楮木知美、西森佳代子、佐藤美咲"
                },
                {
                    "key": "背景美术",
                    "value": "ととにゃん（加藤浩、渡辺久美子、鈴木邦幸、山野井拓巳、加藤光子、坂上裕文、後藤千尋）；3D背景：浅見由一、初田昂陽、伊藤広夢"
                },
                {
                    "key": "3DCG",
                    "value": "MORIE Inc.、unknownCASE inc.、LAPIZ、Griot Groove、プロジェクトスタジオQ、リブぜント·イノべションズ、株式会社BACKBONE、武右ェ門、YAMATOWORKS、ASTROBROS."
                },
                {
                    "key": "摄影",
                    "value": "T2 Studio（葛西実姫、飯島蓮、長谷川大介、福島敏行、岩本泰侑、小林拓未、荻田美穗子、閆昊、川又紗花、原田敦司）"
                },
                {
                    "key": "监修",
                    "value": "摄影监修：福士享（T2 studio）"
                },
                {
                    "key": "企划制作人",
                    "value": "企画营业：池内謙一郎、志田香織、島中創麻、春木早希"
                },
                {
                    "key": "宣传",
                    "value": "バンダイナムコフィルムワークス（畑中貴行、岩崎小丹、大原桃子、川越玲奈、伊藤やよい、長谷川裕介）、株式会社khara（濱岡清吾、島居理惠、濱田雄司、曽我知世、福田育己、小孫真帆）；TV放送：日本テレビ放送網（佐藤貴博、大澤弘子、切田美伸）"
                },
                {
                    "key": "色彩指定",
                    "value": "井上あきこ（Wish）"
                }
            ],
            "rating": {
                "rank": 5937,
                "total": 6096,
                "count": {
                    "1": 122,
                    "2": 84,
                    "3": 101,
                    "4": 349,
                    "5": 634,
                    "6": 1673,
                    "7": 1952,
                    "8": 924,
                    "9": 139,
                    "10": 118
                },
                "score": 6.3
            },
            "total_episodes": 12,
            "collection": {
                "on_hold": 246,
                "dropped": 341,
                "wish": 2050,
                "collect": 5721,
                "doing": 6852
            },
            "id": 526816,
            "eps": 12,
            "meta_tags": [
                "科幻",
                "机战",
                "TV",
                "日本",
                "原创",
                "战斗",
                "冒险"
            ],
            "volumes": 0,
            "series": false,
            "locked": false,
            "nsfw": false,
            "type": 2
        }
    """.trimIndent()